     FIFDISK    IF   E           K DISK
     FIFDISKREN IF   E           K DISK    RENAME(FLD1:FLD2)
     FIFDISKPRE IF   E           K DISK    PREFIX(PRFX)
     FSPOFIL2   IF   E           K DISK    PREFIX(PRFX)  INFDS(SOMEFDS)
     FUFDISKE   UF   E           K DISK
     FUFDISKAE  UF A E           K DISK
     FUFDISKAERPUF A E           K DISK    RENAME(FLD1:FLD2) PREFIX(PRFX)
