      /Free                                                                                                             
       Begsr SUBROUTINE01;                                                                                                    
        SOMEVAR = 1;                                                                                            
      /End-Free                                                                                                         
     C                   ENDSR                                                                                          

     C     SUBROUTINE02  BEGSR                                                                                          
     C                   EVAL      SOMEVAR = 1                                                                       
      /Free
      ENDSR;
      /End-Free
