       Begsr SUBROUTINE01;                                                                                                    
        SOMEVAR = 1;                                                                                            
       ENDSR;

       BEGSR SUBROUTINE02;
       SOMEVAR = 1;
      ENDSR;
