     H NOMAIN
     H COPYRIGHT('Copyright (c) 2005-2007 Scott C. Klement.  All rights +
     H reserved.  A member called "LICENSE" was included with this +
     H distribution')
     H BNDDIR('QC2LE')
