     H NOMAIN
     H COPYRIGHT('Copyright (c) 2005-2007 Scott C. Klement.  All rights +
     H reserved.  A member called "LICENSE" was included with this +
     H distribution')
     H BNDDIR('QC2LE')



     h nomain PGMINFO(*PCML:*MODULE) THREAD(*SERIALIZE)
     h COPYRIGHT('+
     h 5722SS1, 5761SS1 (C) Copyright IBM Corp. 2007, 2007. All rights +
     h reserved. US Government Users Restricted Rights - Use, duplication +
     h or disclosure restricted by GSA ADP Schedule Contract with +
     h IBM Corp. Licensed Materials-Property of IBM')
