       Ctl-Opt NOMAIN;
       Ctl-Opt COPYRIGHT('Copyright (c) 2005-2007 Scott C. Klement.  All rights +
       reserved.  A member called "LICENSE" was included with this +
       distribution');
       Ctl-Opt BNDDIR('QC2LE');



       Ctl-Opt nomain PGMINFO(*PCML:*MODULE) THREAD(*SERIALIZE);
       Ctl-Opt COPYRIGHT('+
       5722SS1, 5761SS1 (C) Copyright IBM Corp. 2007, 2007. All rights +
       reserved. US Government Users Restricted Rights - Use, duplication +
       or disclosure restricted by GSA ADP Schedule Contract with +
       IBM Corp. Licensed Materials-Property of IBM');
