       Ctl-Opt NOMAIN;
       Ctl-Opt COPYRIGHT('Copyright (c) 2005-2007 Scott C. Klement.  All rights +
               reserved.  A member called "LICENSE" was included with this +
               distribution');
       Ctl-Opt BNDDIR('QC2LE');
