     C     ZT            COMP      'X'                                    61                        
     C     ZC            COMP      'X'                                    62                        
     C   45ZFRAI2        COMP      *BLANK                                 45                        
