     C     a             CASEQ     b             sub001
     C     c             caslt     d             sub002
     C                   cas                     sub003
     C                   endcs
