     C     SUBROU1       BEGSR                                                                                          
     C                   CALL      'EXTPGM01'                           46                                              
     C                   PARM                    $PARM01                                                                
     C                   PARM      *BLANKS       $PARM02                                                                
     C                   ENDSR                                                                                          
