     C     GETEMP        BEGSR                                           
                                                                         
     C                   CALL      'PRP06YRG'                            
     C                   PARM      ' '           P06YIOFUNC              
     C                   PARM                    PRPEMPDS                
     C                   PARM                    P06EMP                  
                                                                         
     C                   CALL      'PRP06ZRG'                            
     C                   PARM      ' '           P06ZIOFUNC              
     C                   PARM                    PRPEOCDS                
     C                   PARM                    PRPEHTDS                
     C                   PARM                    PRPETXDS                
     C                   PARM                    P06EMP                  
                                                                         
     C                   ENDSR                                           