     C     GETEMP        BEGSR

     C                   CALL      'PGM1'
     C                   PARM                    PARM1
     C                   PARM                    PARM2
     C                   PARM                    PARM3

     C                   CALL      'PGM2'
     C                   PARM                    PARM4
     C                   PARM                    PARM5
     C                   PARM                    PARM6

     C                   ENDSR
