     D OTitems         DS                  Inz
     D  Otwkdt                             Like(Phdteow)
     D  Ottyp                              Like(Phtyp)
     D  Otstn                              Like(Phstn)
     D  Otdpt                              Like(Phdpt)
     D  Otearnings                   15p 5
     D  Othours                      +2    Like(Phhrs)
     D  Otwghtavgrt                  15p 5
