       Dcl-DS OTitems  INZ;
         Otwkdt                    LIKE(PHDTEOW);
         Ottyp                     LIKE(PHTYP);
         Otstn                     LIKE(PHSTN);
         Otdpt                     LIKE(PHDPT);
         Otearnings     Packed(15:5);
         Othours                   LIKE(PHHRS:+2);
         Otwghtavgrt    Packed(15:5);
       End-DS;
