     C                   ADD       1             SOMEVAR0
     C                   ADD       SOMEVAR1      SOMEVAR0
     C     SOMEVAR2      ADD       SOMEVAR1      SOMEVAR0

     C                   DIV       1             SOMEVAR0
     C                   DIV       SOMEVAR1      SOMEVAR0
     C     SOMEVAR2      DIV       SOMEVAR1      SOMEVAR0

     C                   MULT      1             SOMEVAR0
     C                   MULT      SOMEVAR1      SOMEVAR0
     C     SOMEVAR2      MULT      SOMEVAR1      SOMEVAR0

     C                   SUB       1             SOMEVAR0
     C                   SUB       SOMEVAR1      SOMEVAR0
     C     SOMEVAR2      SUB       SOMEVAR1      SOMEVAR0

     C                   SQRT      2             SOMEVAR
     C                   SQRT      SOMEVAR       SOMEVAR

     C                   Z-ADD     1             SOMEVAR

     C                   Z-SUB     1             SOMEVAR

     C     PCT(XIDX)     MULT(H)   DDAMT#        DEDAMT

     C     PCT(XIDX)     DIV(H)    DDAMT#        DEDAMT

     C     PCT(XIDX)     ADD(H)    DDAMT#        DEDAMT

     C     PCT(XIDX)     SUB(H)    DDAMT#        DEDAMT

     C                   Z-ADD(H)  DDAMT#        NODEC

     C                   Z-SUB(H)  DDAMT#        NODEC

     C                   SQRT(H)   DDAMT#        NODEC
