     C                   Select                                                                                         
     C                   When      VAR01 = '5' And VAR02 < '100'                                                    
     C                   Seton                                        60                                                
     C                   Endsl                                                                                          
                                                                                                                        
     C                   Select                                                                                         
     C                   When      VAR01 = '5' And VAR02 < '100'                                                    
     C                   Seton                                        60                                                
     C                   When      VAR01 = '8' And VAR02 <> '000'                                                   
     C                   Seton                                        61                                                
     C                   When      VAR01 = '9' And VAR02 <> '100'                                                   
     C                   Seton                                        62                                                
     C                   Endsl                                                                                          
                                                                                                                        
     C                   Select                                                                                         
     C                   When      VAR01 = '5' And VAR02 < '100'                                                    
     C                   Seton                                        60                                                
     C                   When      VAR01 = '8' And VAR02 <> '000'                                                   
     C                   Seton                                        61                                                
     C                   Other                                                                      
     C                   Seton                                        62                                                
     C                   Endsl                                                                                          
                                                                                                                        
     C                   Select                                                                                         
     C     VAR01         Wheneq    '1'                                                                                   
     C                   Seton                                        60                                                
     C     VAR01         Whenlt    '1'                                                                                
     C                   Seton                                        61                                                
     C     VAR01         Whengt    '1'                                                                                
     C                   Seton                                        62                                                
     C                   Other                                                                      
     C                   Seton                                        63                                                
     C                   Endsl                                                                                          
