     C     SEARCHARG     Setll     NAMEVAR                                                          
                                                                                                    
     C     SEARCHARG     SETLL     NAMEVAR                            99                            
