     D PREFDS        E DS                  PREFIX(PRFX)

     D MLTLIN          DS
     D  CHRVAR                83     92
     D  BINVAR               370    371B 0
     D  ZNDOVR                        8  0 overlay(Dtime)

     D dtaarads       UDS                  dtaara(*VAR:DTAARANAME)
     D  fld1                          1A
