     D SCREEN          DS                                                                                               
     D  ZSCREN                83     92                                                                                 
     D  ZFM                  261    270                                                                                 
     D  ZCURS                370    371                                                                                 
     D  XCURS                370    371B 0                                                                              
     D  WENCO                378    379B 0                                                                              
