       Dcl-DS SCREEN;
         ZSCREN         Char(10)   Pos(83);
         ZFM            Char(10)   Pos(261);
         ZCURS          Char(2)    Pos(370);
         XCURS          Bindec(4)  Pos(370);
         WENCO          Bindec(4)  Pos(378);
        End-DS;
