     H dftactgrp(*yes)                OPTION(*NODEBUGIO)  CVTOPT(*VARCHAR)                         
     H AlwNull(*usrctl)                                                                            
     H cvtopt(*graphic:*vargraphic) ccsid(*graph:*src) DftActgRp(*NO)                               
