Ctl-Opt dftactgrp(*yes)                OPTION(*NODEBUGIO)  CVTOPT(*VARCHAR);
Ctl-Opt AlwNull(*usrctl);
Ctl-Opt cvtopt(*graphic:*vargraphic) ccsid(*graph:*src) DftActgRp(*NO);
