     C     *IN60         IFEQ      '1'                                                              
     C                   SETON                                        634436                        
     C                   ELSE                                                                       
     C     *IN44         IFEQ      '1'                                                              
     C                   SETON                                        36                            
     C                   ELSE                                                                       
     C                   SETON                                        40                            
     C                   END                                                                        
     C                   END                                                                        
