     C     VAR0          Chain     VAR1                                                                                 
     C     1             CHAIN     VAR2                               95                            
     C     VAR3          CHAIN     VAR4                               94                            
