     C                   CLEAR                   SOMEVAR                                            
     C                   CLEAR                   SOMEVAR          15 5                            
     C                   CLEAR       *ALL        SOMEVAR          15 5                            
     C      *NOKEY       CLEAR                   SOMEVAR          15 5                            
     C      *NOKEY       CLEAR       *ALL        SOMEVAR          15 5                            
