     D ARRDIM          S            198    DIM(15)                                                                      
     D ARRCOMP         S             80    DIM(3) CTDATA PERRCD(1)                                  
     D ARRASC          S             14    DIM(999) ASCEND                                          
