       Dcl-S ARRDIM       Char(198)  DIM(15);
       Dcl-S ARRCOMP      Char(80)   DIM(3) CTDATA PERRCD(1);
       Dcl-S ARRASC       Char(14)   DIM(999) ASCEND;
