     D                SDS                                                                                               
     D  ZPROG                  1     10                                                                                 
     D  ZSTATU                11     15                                                                                 
     D  ZJOB                 244    253                                                                                 
     D  ZUSER                254    263                                                                                 
     D  ZDATE                276    281  0                                                                              
