       Dcl-DS *N  PSDS;
         ZPROG          Char(10)   Pos(1);
         ZSTATU         Char(5)    Pos(11);
         ZJOB           Char(10)   Pos(244);
         ZUSER          Char(10)   Pos(254);
         ZDATE          Zoned(6:0) Pos(276);
        End-DS;
