     C                   EXCEPT    L                                                                
                                                                                                    
     C                   EXCEPT                                                                     
