     C                   ADD       1             SOMEVAR0                                           
     C                   ADD       1             SOMEVAR0             20                   C                   ADD       SOMEVAR1      SOMEVAR0                                           
     C     SOMEVAR2      ADD       SOMEVAR1      SOMEVAR0                                           
                                                                                                    
     C                   DIV       1             SOMEVAR0                                           
     C                   DIV       1             SOMEVAR0             20                              
     C                   DIV       SOMEVAR1      SOMEVAR0                                           
     C     SOMEVAR2      DIV       SOMEVAR1      SOMEVAR0                                           
                                                                                                    
                                                                                                    
     C                   MVR                     SOMEVAR              20                           
                                                                                                    
     C                   MULT      1             SOMEVAR0                                           
     C                   MULT      1             SOMEVAR0             20                              
     C                   MULT      SOMEVAR1      SOMEVAR0                                           
     C     SOMEVAR2      MULT      SOMEVAR1      SOMEVAR0                                           
                                                                                                    
     C                   SUB       1             SOMEVAR0                                           
     C                   SUB       1             SOMEVAR0             203 0                              
     C                   SUB       SOMEVAR1      SOMEVAR0                                           
     C     SOMEVAR2      SUB       SOMEVAR1      SOMEVAR0                                           
                                                                                                    
     C                   SQRT      2             SOMEVAR                                            
     C                   SQRT      SOMEVAR       SOMEVAR                                      
                                                                                                    
     C                   Z-ADD     1             SOMEVAR                                            
                                                                                                    
     C                   Z-SUB     1             SOMEVAR                                            
