     d $MgrMsg         s            132a   Inz('Managers Discretionary - Extra-
     d                                     Effort- Bonus')
     d ErnSeq          s              3  0 Inz(1)
