     FATASSV10  CF   E             WORKSTN INFDS(ECRAN)                                             
     F                                     SFILE(FMS1:ZRECN1)                                       
