     C   KG              EXSR      DEBLOQ
     C   KG              SETON                                        LR
     C   LR              GOTO      FIN
